Revit 2026 API

# IFCExportElement Enumeration

---

An enumerated type defining if an element is exported to IFC or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCExportElement
```
```vb
Public Enumeration IFCExportElement
```
```cpp
public enum class IFCExportElement
```
```fsharp
type IFCExportElement
```

| Member name | Value | Description |
| --- | --- | --- |
| ByType | 0 | Export element to IFC according to type settings. |
| No | 2 | Don't export element to IFC regardless of type or category settings. |
| Yes | 1 | Export element to IFC regardless of type or category settings. |

#### Reference

Autodesk.Revit.DB Namespace